content-org/debug-summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debug 小结</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Debug 小结</h1>
<p>
调试 <code>bug</code> 的时候要有耐心, 要不断测试, 直到找到问题原因.
</p>


<div id="outline-container-org9fa79a0" class="outline-2">
<h2 id="org9fa79a0"><span class="section-number-2">1</span> 确定 <code>bug</code> 出现的方式</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>一定要找到稳定重现的方式, 这样才能方便下面的调试</li>
<li>如果找不到稳定重现的方法就只能根据上次出现的情形, 去查看相关的代码, 猜测可能出问题的地方, 然后针对那一块进行调试, 直到找到稳定重现方式</li>
</ul>
</div>
</div>

<div id="outline-container-org2b289ab" class="outline-2">
<h2 id="org2b289ab"><span class="section-number-2">2</span> 定位出问题的代码</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>再找到稳定重现方式后, 开始定位出问题的函数, 然后加入调试信息, 不断尝试, 直到找到有问题的代码</li>
<li>找到有问题的代码后, 如果发现是第三方库里的函数,可以打印出每次调用的输入输出参数, 看看是否有迹可循, 可以单独写个小程序, 传入问题的参数, 进行不断测试, 来确定第三方库有没有问题</li>
<li>如果自己程序的代码, 就一行一行的慢慢测试, 确定问题的原因, 原因找到了就可以开始思考解决方法了</li>
</ul>

<p>
&lt;!&#x2013;more&#x2013;&gt;
</p>
</div>
</div>

<div id="outline-container-org516b7fc" class="outline-2">
<h2 id="org516b7fc"><span class="section-number-2">3</span> 修复 <code>bug</code></h2>
<div class="outline-text-2" id="text-3">
<p>
修复 <code>bug</code> 时一定要仔细检查新添加的代码, 看看会不会造成其它的 <code>bug</code>, 一定要不断测试, 把函数输入输出状态都打印出来, 以免出现界面是对的, 但函数的数据有误.
</p>

<p>
对于开源的第三方库有问题时, 就把它的代码下下来, 加上调试信息后, 然后安装, 让你的程序使用自己编译的第三方库, 这样方便查找问题.
因为有时可能第三方库再使用时需要初始化一些资源, 而你使用的接口并没有做或少做了一点, 这样就导致你的程序出了问题.
这时就可以在程序中添加相关的初始化代码, 来处理这类问题, 这类问题一般第三方库升级时可能出现.
</p>

<p>
若知道问题的原因后(这个原因一定要是相关低层的, 不能说是由于 A 调了 B , B 出问题了, 就把问题原因归与 A 的头上, 一定要是相当精确的), 不知道怎么修改, 这时就可以向组内成员求助, 或者去了解这方面的知识.
</p>
</div>
</div>

<div id="outline-container-org859c937" class="outline-2">
<h2 id="org859c937"><span class="section-number-2">4</span> 性能调试工具</h2>
<div class="outline-text-2" id="text-4">
<p>
对于 <code>C/C++</code> 代码, 可以使用 <code>Google Proftools</code> 工具来调试. 它以程序调用的方式生成每次调用的性能消耗图, 方便定位占用资源多的函数.
</p>

<p>
文档见: <a href="http://google-perftools.googlecode.com/svn/trunk/doc/">Google Proftools Documents</a> , 使用方法自行 <code>google</code> .
</p>
</div>
</div>

<div id="outline-container-org78c8f54" class="outline-2">
<h2 id="org78c8f54"><span class="section-number-2">5</span> 网站推荐</h2>
<div class="outline-text-2" id="text-5">
<p>
还可以去一些开发者网站提问:
</p>

<ul class="org-ul">
<li><a href="http://stackoverflow.com/">StackOverflow</a></li>
<li><a href="https://www.quora.com/">国外的知乎: Quora</a></li>
<li><a href="http://segmentfault.com/">SegmentFault</a></li>
</ul>

<p>
或者到 <a href="http://www.ibm.com/developerworks/cn/">IBM Developer</a> 看写相关的技术文章, 前端的话还可以去 <a href="https://developer.mozilla.org/">Mozilla Developer</a> .
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-02-03T15:06:21+08:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
